<template>
	<section class="reviews" id="reviews">
		<div class="reviews__wrapper container">
			<h2 class="reviews__title">Отзывы учениц</h2>	
			<div class="reviews__items g-flex">
				<div class="reviews__item" v-for="review in reviews">
					<div class="reviews__item-info g-flex">
						<div class="reviews__item-wrap">
							<img :src="review.img" alt="username" class="reviews__item-img">
							<h3 class="reviews__item-user">{{ review.name }}</h3>
						</div>
						<p class="reviews__item-date">{{ review.date }}</p>
					</div>
					<p class="reviews__item-text">{{ review.text }}</p>
				</div>
			</div>
		</div>
	</section>
</template>

<script setup>
	import { ref } from "vue"
	import photoUser from '@/assets/images/eyelashes-banner.jpg';

	const reviews = ref([
		{
			img: photoUser,
			date: '28 НОЯБРЯ 2025г.',
			name: 'Имя ученицы',
			text: '«Влада, спасибо большое за такое простое, но подробное обучение! столько тонкостей! И здорово, что всегда есть возможность вернуться пересмотреть и отдельное спасибо за то как снимать и обрабатывать видео. Я в полном восторге!».'
		},
		{
			img: photoUser,
			date: '28 НОЯБРЯ 2025г.',
			name: 'Имя ученицы',
			text: '«Так бурно на моё лами еще не реагировали! Я нахожусь в Норвегии и я единственная, у кого есть эта техника здесь! Норвежки будут в шоке!) »'
		},
		{
			img: photoUser,
			date: '28 НОЯБРЯ 2025г.',
			name: 'Имя ученицы',
			text: '«Здравствуйте, Владислава! Прошла теорию по корейскому лами еще в начале июля, откладывала в долгий ящик и сегодня взяла модель. Я В ВОСТОРОГЕ! Честно, шло у меня все не очень, сложно было изолировать нижнее веко тк глаз возрастной, подклейки и все такое.. В процессе 1 состава был страх попасть в глаз, на втором я вообще отчаилась потому что они не клеились к валику, хотя я держала 100% достаточно.. Но всё получиллось просто супер!»'
		},
		{
			img: photoUser,
			date: '28 НОЯБРЯ 2025г.',
			name: 'Имя ученицы',
			text: '«Влада, спасибо большое за такое простое, но подробное обучение! столько тонкостей! И здорово, что всегда есть возможность вернуться пересмотреть и отдельное спасибо за то как снимать и обрабатывать видео. Я в полном восторге!».'
		},
		{
			img: photoUser,
			date: '28 НОЯБРЯ 2025г.',
			name: 'Имя ученицы',
			text: '«Влада, спасибо большое за такое простое, но подробное обучение! столько тонкостей! И здорово, что всегда есть возможность вернуться пересмотреть и отдельное спасибо за то как снимать и обрабатывать видео. Я в полном восторге!».'
		},
	])
</script>

<style lang="scss">
	@use "reviews.scss"
</style>